Examinator/src/Catalogs/ЭлектронныеКурсы/ЭлектронныеКурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлектронныеКурсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинальнаяСтраница</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ЭлектронныеГлоссарии</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ИзмененныеЭлектронныеКурсы/ИзмененныеЭлектронныеКурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененныеЭлектронныеКурсы</name>
  <resources>
    <name>ГотовКПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыЭлектронныхКурсов/ТипыЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхКурсов</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Учебник</name>
  </enumValues>
  <enumValues>
    <name>Слайдовый</name>
  </enumValues>
  <enumValues>
    <name>SCORM</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ЭлектронныеКурсы/Forms/ФормаСписка/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОписаниеДопустимыхТиповПеретаскивания; // Типы, которые можно перетаскивать в курс

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;	
	
	// Получаем переменные
	
	ЕстьПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.ЭлектронныеКурсы);	
	
	// Прячем все команды Создать
	
	ВсеТипыКурсов = Новый Массив;;
	
	Для каждого ТипКурса Из Перечисления.ТипыЭлектронныхКурсов Цикл	
		ВсеТипыКурсов.Добавить(ТипКурса);	
	КонецЦикла;	
	
	ВсегоТиповКурсов = ВсеТипыКурсов.Количество();
	
	Для каждого ТипКурса Из ВсеТипыКурсов Цикл	
		ИмяТипа = ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(ТипКурса);		
		ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "КомандаСоздать" + ИмяТипа, Ложь);
	КонецЦикла;	
	
	// Показываем нужные команды Создать
	
	ТипыКурсов = РазработкаЭлектронныхКурсовСлужебный.ТипыЭлектронныхКурсов();
	
	Если ЕстьПравоИзменения Тогда
	
		Если ТипыКурсов.Количество() > 1 Тогда			
			ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "ПодменюСоздать", Истина);					
		Иначе			
			ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "ПодменюСоздать", Ложь);
			ИмяТипа = ЭлектронноеОбучениеСлужебный.ИмяЗначенияПеречисления(ТипыКурсов[0]);
			ЭлектронноеОбучениеСлужебныйКлиентСервер.УстановитьВидимостьЭлементаФормыБезопасно(ЭтотОбъект, "КомандаСоздать" + ИмяТипа, Истина);					
		КонецЕсли;
		
	КонецЕсли;
	
	// Устанавливаем видимость элементов курса	
	
	УстановитьВидимостьПредупрежденияОбИзмененныхКурсах();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЭлектронныйКурсЗаписан" Тогда
		Элементы.Список.Обновить();
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредупреждениеОбИзмененныхКурсах", 2, Истина);
	КонецЕсли;

	Если ИмяСобытия = "ВыполняетсяПубликацияЭлектронногоКурса" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПредупреждениеОбИзмененныхКурсах", 2, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список


&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если НЕ ВебКлиент Тогда
		
	ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение);
	
	// 1. Проверяем возможность перетаскивания, когда нет описания типов.
	
	Если ОписаниеДопустимыхТиповПеретаскивания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Проверяем возможность перетаскивания с описанием допустимых типов.
	
	Если ТипЗначения = Тип("Массив") Тогда
		ТипЗначения = ТипЗнч(ПараметрыПеретаскивания.Значение[0]);
	КонецЕсли;
	
	Если ОписаниеДопустимыхТиповПеретаскивания.СодержитТип(ТипЗначения) Тогда		
		СтандартнаяОбработка = Ложь;
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;		
	КонецЕсли;		
	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если НЕ ВебКлиент Тогда

	Если (ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")
		И ПараметрыПеретаскивания.Значение.Количество() > 0
		И ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Файл"))
		ИЛИ ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда		
			МассивФайлов = ПараметрыПеретаскивания.Значение;
		Иначе
			МассивФайлов = Новый Массив;
			МассивФайлов.Добавить(ПараметрыПеретаскивания.Значение);
		КонецЕсли;
		
		КаталогДляЗагрузкиВКурс = Неопределено;
		
		Для каждого ФайлДляЗагрузки Из МассивФайлов Цикл
		
			Если ФайлДляЗагрузки.ЭтоКаталог() Тогда
				КаталогДляЗагрузкиВКурс = ФайлДляЗагрузки;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		Если КаталогДляЗагрузкиВКурс <> Неопределено Тогда
			
			ТипыКурсов = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ТипыЭлектронныхКурсов();
			
			ТипКурса = Неопределено;
			
			Если ТипыКурсов.Количество() = 1 Тогда
				
				ТипКурса = ТипыКурсов[0];
				
			Иначе
				
				ЭтоФайлыДляСлайдовогоКурса = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ЭтоФайлыДляСлайдовогоКурса(КаталогДляЗагрузкиВКурс.ПолноеИмя);
				
				Если ЭтоФайлыДляСлайдовогоКурса Тогда
					ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый");
				Иначе
					ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый") Тогда
				ТекстПредупреждения = НСтр("ru = 'Будет создан слайдовый курс из файлов каталога ""%1"". Продолжить?'");
			ИначеЕсли ТипКурса = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник") Тогда
				ТекстПредупреждения = НСтр("ru = 'Будет создан электронный учебник из файлов каталога ""%1"". Продолжить?'");
			Иначе
				ВызватьИсключение НСтр("ru = 'Тип курса не определен'");				
			КонецЕсли;
			
			ПараметрыПродолжения = Новый Структура("ПутьККаталогуДляЗагрузкиВКурс, ТипКурса", КаталогДляЗагрузкиВКурс.ПолноеИмя, ТипКурса);			
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, КаталогДляЗагрузкиВКурс.Имя);					
			Оповещение = Новый ОписаниеОповещения("Подключаемый_ЗагрузитьФайлыСДискаВБазу", ЭтотОбъект, ПараметрыПродолжения);		
			ПоказатьВопрос(Оповещение, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
			
	КонецЕсли;

	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьФайлыСДискаВБазу(Результат, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		
	Если НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ПутьККаталогуДляЗагрузкиВКурс) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
		
	ПараметрыФормыКурса = Новый Структура;
	ПараметрыФормыКурса.Вставить("ПутьККаталогуСФайламиКурса", ДополнительныеПараметры.ПутьККаталогуДляЗагрузкиВКурс);
	ПараметрыФормыКурса.Вставить("РежимРедактирования", Истина);
	ПараметрыФормыКурса.Вставить("ТипЭлектронногоКурса", ДополнительныеПараметры.ТипКурса);
	
	Состояние(НСтр("ru = 'Загружается каталог...'"),,ДополнительныеПараметры.ПутьККаталогуДляЗагрузкиВКурс);
	
	ОткрытьФорму("ОбщаяФорма.ЭлектронныйКурс", ПараметрыФормыКурса, ЭтотОбъект);		
		
	#КонецЕсли

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("РегистрСведений.НастройкиЭлектронныхКурсов.Форма.ФормаРедактированияНастроек");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИзмененныеКурсыНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.ИзмененныеЭлектронныеКурсы.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура Подключаемый_ОбновитьПредупреждениеОбИзмененныхКурсах()	
	ОбновитьПредупреждениеОбИзмененныхКурсах();	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредупреждениеОбИзмененныхКурсах()	
	
	Если НЕ ЕстьПравоИзменения Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьПредупрежденияОбИзмененныхКурсах();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредупрежденияОбИзмененныхКурсах()
	
	Если НЕ ЕстьПравоИзменения Тогда
		Элементы.ГруппаИзмененные.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	КоличествоИзмененных = РегистрыСведений.ИзмененныеЭлектронныеКурсы.КоличествоИзмененныхКурсов();
	
	Если КоличествоИзмененных > 0 Тогда		
		Элементы.ГруппаИзмененные.Видимость = Истина;
		КоличествоИзмененныхСтрокой = НСтр("ru = ';%1 курс отредактирован;;%1 курса отредактировано;%1 курсов отредактировано;%1 курса отредактировано'");
		КоличествоИзмененныхСтрокой = СтрокаСЧислом(КоличествоИзмененныхСтрокой, КоличествоИзмененных, ВидЧисловогоЗначения.Количественное, "L=ru");
		Элементы.ДекорацияИзмененныеКурсы.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, но изменения еще не опубликованы и не будут доступны при изучении курса'"), КоличествоИзмененныхСтрокой);
	Иначе
		Элементы.ГруппаИзмененные.Видимость = Ложь;
		Возврат;		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

МассивТипов = Новый Массив;
#Если НЕ ВебКлиент Тогда
МассивТипов.Добавить(Тип("Файл"));
#КонецЕсли
ОписаниеДопустимыхТиповПеретаскивания = Новый ОписаниеТипов(МассивТипов);

#КонецОбласти
